Autodesk.Navisworks.Api.View
Represents a view of a document.

Autodesk.Navisworks.Api.View.CopyViewpointFrom(Autodesk.Navisworks.Api.Viewpoint,Autodesk.Navisworks.Api.ViewChange)
Updates the viewpoint in this view based on change required.

Autodesk.Navisworks.Api.View.CreateViewpointCopy
Returns a viewpoint representing this view.

Autodesk.Navisworks.Api.View.Dispose


Autodesk.Navisworks.Api.View.Dispose(System.Boolean)


Autodesk.Navisworks.Api.View.Document
The document associated with this View.

Autodesk.Navisworks.Api.View.EndInteractive
Decrements an internal counter that determines if the view is in interactive mode.
As the count goes from 1 to 0 the View is set out of interactive mode.
Should be used with a matched call to StartInteractive.

Autodesk.Navisworks.Api.View.FocusOnCurrentSelection
Focuses the view on the currently selected objects.

Autodesk.Navisworks.Api.View.GenerateImage(Autodesk.Navisworks.Api.ImageGenerationStyle,System.Int32,System.Int32,System.Boolean)
Generates an Image for this View.

Autodesk.Navisworks.Api.View.GenerateImage(Autodesk.Navisworks.Api.ImageGenerationStyle,System.Int32,System.Int32,System.Double,System.Boolean)
Generates an Image for this View.

Autodesk.Navisworks.Api.View.GetClippingPlanes
Gets clipping planes in the form of a JSON ClipPlaneSet object.

Autodesk.Navisworks.Api.View.GetRedlines
Gets redlines in the form of a JSON RedlineCollection object.

Autodesk.Navisworks.Api.View.Height
The renderable height of the view in Windows screen pixels

Autodesk.Navisworks.Api.View.IsDisposed
Has this view been disposed ?

Autodesk.Navisworks.Api.View.IsInteractive
Determines if the view is in interactive mode.

Autodesk.Navisworks.Api.View.LookFromFrontRightTop
Move's the Camera to look from FrontRightTop.

Autodesk.Navisworks.Api.View.PickItemFromPoint(System.Int32,System.Int32)
Picks a single item from the given window coordinate point.
Returns:
A PickItemResult object that contains the picked item.
Returns null if nothing is picked or coordinates are invalid.

Autodesk.Navisworks.Api.View.PickItemFromPoint(System.Int32,System.Int32,System.Int32,System.Boolean,Autodesk.Navisworks.Api.PickPrimitives)
Picks a single item from the given window coordinate point.
pickingWidth:
Width of picking region in pixels. Normally 1.
asRendered:
Whether picking should operate only on items that were rendered during the last frame. Normally true.
Returns:
A PickItemResult object that contains the picked item.
Returns null if nothing is picked or coordinates are invalid.

Autodesk.Navisworks.Api.View.PickItemFromRectangle(System.Int32,System.Int32,System.Int32,System.Int32)
Picks a single item from the given window coordinate rectangle.
Returns:
A PickItemResult object that contains the picked item
Returns null if nothing is picked or coordinates are invalid.

Autodesk.Navisworks.Api.View.PickItemFromRectangle(System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean,Autodesk.Navisworks.Api.PickPrimitives)
Picks a single item from the given window coordinate rectangle.
asRendered:
Whether picking should operate only on items that were rendered during the last frame. Normally true.
Returns:
A PickItemResult object that contains the picked item
Returns null if nothing is picked or coordinates are invalid.

Autodesk.Navisworks.Api.View.PickItemsFromRectangle(System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean)
Picks multiple items from the given window coordinate rectangle.
containedOnly:
Whether picking should operate only on items that are contained in the rectangle
Returns:
A ModelItemCollection containing the picked items.
Returns null if nothing is picked or coordinates are invalid.

Autodesk.Navisworks.Api.View.PickItemsFromRectangle(System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
Picks multiple items from the given window coordinate rectangle.
containedOnly:
Whether picking should operate only on items that are contained in the rectangle.
asRendered:
Whether picking should operate only on items that were rendered during the last frame. Normally true.
Returns:
A ModelItemCollection containing the picked items.
Returns null if nothing is picked or coordinates are invalid.

Autodesk.Navisworks.Api.View.ProjectPoint(Autodesk.Navisworks.Api.Point3D,System.Boolean,System.Boolean)
Converts a point in world space into view coordinates.

Autodesk.Navisworks.Api.View.RequestDelayedRedraw(Autodesk.Navisworks.Api.ViewRedrawRequests)
Asks for Render after all other events have been processed.

Autodesk.Navisworks.Api.View.SetClippingPlanes(System.String)
Sets clipping planes.
jsonClipPlaneSet: Clipping planes in the form of a JSON ClipPlaneSet object.
Throws System.ArgumentException:
Failed to set clipping planes.

Autodesk.Navisworks.Api.View.SetRedlines(System.String)
Sets redlines.
jsonRedlineCollection: Redlines in the form of a JSON RedlineCollection object.
Throws System.ArgumentException:
Failed to set redlines.

Autodesk.Navisworks.Api.View.StartInteractive
Increments an internal counter that determines if the view is in interactive mode.
As the count goes from 0 to 1 the View is set into interactive mode.
Should be used with a matched call to EndInteractive.

Autodesk.Navisworks.Api.View.TrySetClippingPlanes(System.String)
Sets clipping planes.
jsonClipPlaneSet: Clipping planes in the form of a JSON ClipPlaneSet object.

Autodesk.Navisworks.Api.View.TrySetRedlines(System.String)
Sets redlines.
jsonRedlineCollection: Redlines in the form of a JSON RedlineCollection object.

Autodesk.Navisworks.Api.View.Width
The renderable width of the view in Windows screen pixels